cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'bramstein/webfonttools'

# A simple command line interface for the Mac App Store
brew 'mas'

# Security
mas '1Password', id: 443987910
brew 'keybase'
cask 'keybase'

# Essential
brew 'zsh'
# GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
brew 'moreutils'
# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
# GNU `sed`, overwriting the built-in `sed`
brew 'gnu-sed', args: ['--with-default-names']
brew 'rename'
brew 'libevent'
brew 'ponysay'
brew 'fortune'
cask 'spotify'

# Version control
brew 'git'
brew 'git-extras' # https://github.com/tj/git-extras
brew 'git-flow'
brew 'git-lfs'
brew 'git-subrepo'
brew 'legit'
brew 'mercurial'

# Tools
brew 'awscli'
brew 'lynx'
brew 'wrk'

# Languages
cask 'java'
brew 'boot-clj'
brew 'drip'
brew 'elixir'
brew 'erlang'
brew 'go'
brew 'leiningen'
brew 'lua'
brew 'python'
brew 'python3'
brew 'scala'

# Version management
brew 'nvm'
brew 'rbenv'

# Databases
brew 'datomic'
# brew 'mongodb', restart_service: :changed
brew 'mongodb32', restart_service: :changed
brew 'neo4j', restart_service: :changed
brew 'postgresql', restart_service: :changed
brew 'rabbitmq', restart_service: :changed
brew 'redis', restart_service: :changed
brew 'rethinkdb', restart_service: :changed
brew 'sqlite'

# Database tools
brew 'pgcli'
cask 'base'
cask 'postico'

# Daily
cask 'flux'

# Browsers
cask 'chromium'
cask 'firefox-aurora'
cask 'firefoxdeveloperedition'
cask 'firefoxnightly'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'torbrowser'
cask 'webkit-nightly'

# Virtualization
cask 'virtualbox'
cask 'parallels-desktop'
cask 'docker-toolbox'

# Network
brew 'httpie'
brew 'mtr' # traceroute and ping in a single tool
brew 'wget'
brew 'wifi-password' # get the current wifi-password
cask 'charles'
# cask 'glimmerblocker' # network based ad blocker
cask 'screens' # vnc client
cask 'tunnelbear' # free tunnel

# Terminal
brew 'autojump' # a faster way to navigate your filesystem
brew 'readline'
brew 'source-highlight' # source-code syntax highlighter
brew 'thefuck' # corrects your previous console command
brew 'tree' # display directories as trees

# Development
brew 'android-sdk'
brew 'autoenv'
brew 'carthage'
# brew 'flow' # install locally or via npm
brew 'hub' # a command-line wrapper for git that makes you better at GitHub
brew 'hugo' # static site generator
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'phantomjs'
brew 's3cmd'
brew 'watchman'
cask 'dash'
cask 'exponent-xde'
cask 'genymotion'
cask 'heroku'
cask 'iterm2'
cask 'ngrok'
cask 'reactotron'
cask 'tower'

# Editors
brew 'macvim'
brew 'tmux'
cask 'atom'
cask 'caret'
cask 'lighttable'
cask 'macdown'
cask 'sublime-text'
cask 'visual-studio-code'
mas 'iA Writer Classic', id: 439623248
mas 'OmmWriter', id: 412347921
mas 'OmniFocus', id: 402835630
mas 'Simplenote', id: 692867256
mas 'WriteRoom', id: 417967324

# Design
# brew 'sfnt2woff-zopfli'
# brew 'sfnt2woff'
# brew 'woff2'
cask 'sketch-toolbox'
cask 'sketch'
cask 'skyfonts'
mas 'Pixelmator', id: 407963104

# Utility
brew 'aspell'
cask 'kaleidoscope' # compare files

# Others
cask 'screenflow'
# cask 'duet' # use your iphone as a screen, requires root
mas 'Moom', id: 419330170
mas 'Living Earth Desktop', id: 539362919
mas 'The Unarchiver', id: 425424353

# Personal management
cask 'ynab' # money management
mas 'Clear', id: 504544917
mas 'Mint QuickView', id: 533491939
mas 'Timecop', id: 466285239

# Media
brew 'imagemagick'
brew 'ffmpeg'
brew 'gifsicle'
brew 'lame'
brew 'x264'
brew 'xvid'
cask 'gifrocket'

# Consumption
cask 'jadengeller-helium' # floating web pane
cask 'reeder' # rss reader
cask 'vlc'
mas 'Kindle', id: 405399194

# Collaboration
brew 'weechat'
cask 'discord'
cask 'skype'
cask 'slack'
cask 'dropbox'

# Other
# mas 'Air Display', id: 419449718
cask 'geekbench'
cask 'licecap'
