tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# Essential
brew 'zsh'

# GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
brew 'moreutils'

# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'

# GNU `sed`, overwriting the built-in `sed`
brew 'gnu-sed', args: ['--with-default-names']
brew 'rename'
brew 'libevent'

# ASDF dependencies

brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
# brew 'readline'
# brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
# brew 'unzip'
# brew 'curl'
brew 'gnupg' # verifies authenticity of plugin

# Version control
brew 'asdf'
brew 'git'
brew 'git-lfs'
brew 'git-delta'
brew 'hub' # github cli

# Languages
brew 'drip'
brew 'scala'
brew 'boot-clj'
brew 'leiningen'
brew 'elixir'
brew 'erlang'
brew 'go'
brew 'lua'
brew 'python'
brew 'python3'

# Version management
brew 'rbenv'
brew 'nvm'
brew 'asdf'

# Environment
brew 'direnv'

# Database and database adjacent …
brew 'redis', restart_service: :changed
brew 'rabbitmq', restart_service: :changed
brew 'datomic'
brew 'sqlite'
brew 'postgresql', restart_service: :changed
brew 'mongodb', restart_service: :changed
brew 'neo4j', restart_service: :changed
brew 'rethinkdb', restart_service: :changed

# CLIs
tap 'prisma/prisma'
brew 'prisma'

# Browsers

# Network
brew 'httpie'
brew 'mtr' # traceroute and ping in a single tool
brew 'wget'
brew 'wifi-password' # get the current wifi-password
brew 'wrk'

# Development
brew 'carthage'
brew 'watchman'

# Terminal
brew 'thefuck' # corrects your previous console command
brew 'tree' # display directories as trees

# Virtualization
brew 'kubectl'
brew 'kubeless'
brew 'kubernetes-helm'
brew 'terraform'
brew 'ansible'

# Deployment
tap 'aws/tap'
brew 'awscli'
brew 's3cmd'
brew 'aws-sam-cli'
tap 'stackery/tap'
brew 'stackery-cli'

# Editors
brew 'emacs'
brew 'macvim'
brew 'tmux'

# Utility
brew 'aspell'

# Media processing
brew 'pngquant'
brew 'imagemagick'
brew 'ffmpeg'
brew 'libvorbis'
brew 'ffmpeg2theora'
brew 'gifsicle'
brew 'lame'
brew 'x264'
brew 'xvid'

# Amusement
brew 'fortune'
brew 'ponysay'
brew 'lynx'
