cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# A simple command line interface for the Mac App Store
brew 'mas'

# Security
mas '1Password', id: 443987910
cask 'keybase'

# Essential
brew 'zsh'
# GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
brew 'moreutils'
# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
# GNU `sed`, overwriting the built-in `sed`
brew 'gnu-sed', args: ['--with-default-names']
brew 'rename'
brew 'libevent'
brew 'ponysay'
brew 'fortune'

# very essential
cask 'spotify'

# Version control
brew 'git'
# brew 'git-extras' # https://github.com/tj/git-extras
brew 'git-flow'
brew 'git-lfs'
brew 'legit'
# brew 'git-subrepo'
# brew 'mercurial'

# Tools, … but are they not all tools?
brew 'awscli'
brew 'lynx'
brew 'wrk'

# Languages
cask 'java'
brew 'drip'
brew 'scala'
brew 'boot-clj'
brew 'leiningen'

brew 'elixir'
brew 'erlang'

brew 'go'

brew 'lua'

brew 'python'
brew 'python3'

# cask 'dotnet'
# cask 'dotnet-sdk'


# Version management
brew 'nvm'
brew 'rbenv'

# Database and database adjacent …
brew 'zookeeper'
brew 'redis', restart_service: :changed
brew 'rabbitmq', restart_service: :changed
brew 'kafka'
brew 'datomic'
brew 'sqlite'
brew 'postgresql', restart_service: :changed
brew 'mongodb', restart_service: :changed
brew 'neo4j', restart_service: :changed
brew 'rethinkdb', restart_service: :changed

# Database tools
brew 'pgcli'
cask 'base'
cask 'postico'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'safari-technology-preview'
cask 'torbrowser'

# Virtualization
cask 'virtualbox'
cask 'docker'
cask 'vagrant'
# cask 'parallels-desktop'

# Network
brew 'httpie'
brew 'mtr' # traceroute and ping in a single tool
brew 'wget'
brew 'wifi-password' # get the current wifi-password
cask 'charles'
# cask 'glimmerblocker' # network based ad blocker
cask 'screens' # vnc client
cask 'tunnelbear' # free tunnel


# Terminal
# brew 'autojump' # a faster way to navigate your filesystem
# brew 'readline'
# brew 'source-highlight' # source-code syntax highlighter
brew 'thefuck' # corrects your previous console command
brew 'tree' # display directories as trees

# Development
# brew 'android-sdk'
# brew 'autoenv'
brew 'carthage'
brew 'hub' # a command-line wrapper for git that makes you better at GitHub
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 's3cmd'
brew 'watchman'
cask 'expo-xde'
# cask 'genymotion'
cask 'iterm2'
cask 'ngrok'
# cask 'reactotron'
# cask 'tower'
cask 'hyper'

# Deployment
cask 'now'

# Editors
brew 'emacs'
brew 'macvim'
brew 'tmux'
cask 'atom'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'caret'
# cask 'lighttable'
cask 'macdown'
# cask 'nvalt'
# mas 'iA Writer Classic', id: 439623248
# mas 'OmmWriter', id: 412347921
# mas 'OmniFocus', id: 402835630
# mas 'Simplenote', id: 692867256
# mas 'WriteRoom', id: 417967324

# Design
# brew 'sfnt2woff-zopfli'
# brew 'sfnt2woff'
# brew 'woff2'
cask 'sketch'
cask 'sketch-toolbox'
# cask 'skyfonts'
mas 'Pixelmator', id: 407963104

# Utility
brew 'aspell'
cask 'kaleidoscope' # compare files

# Others
# cask 'screenflow'
# cask 'duet' # use your iphone as a screen, requires root
mas 'Moom', id: 419330170
mas 'The Unarchiver', id: 425424353

# Personal management
mas 'Clear', id: 504544917
mas 'Timecop', id: 466285239

# Media
brew 'pngquant'
brew 'imagemagick'
brew 'ffmpeg'
brew 'gifsicle'
brew 'lame'
brew 'x264'
brew 'xvid'
cask 'gifrocket'

# Consumption
# cask 'jadengeller-helium' # floating web pane
# cask 'reeder' # rss reader
cask 'vlc'
mas 'Kindle', id: 405399194

# Collaboration
brew 'weechat'
cask 'discord'
cask 'skype'
cask 'slack'

# Other
# mas 'Air Display', id: 419449718
cask 'geekbench'
# cask 'licecap'

# Unfortunate occupational hazards
cask 'citrix-receiver'
